msg = {
    'visible_object_error':
    'На странице не отобразился запрошенный объект',

    'first_test_start':
    'Запуск теста №1 "test_search_tensor".',

    'search_field_succ':
    'Поле поиска на главной странице Яндекса найдено.',

    'suggest_list_succ':
    'При вводе текста в поле поиска, таблица с подсказками отобразилась.',

    'search_result_succ':
    'Результаты поиска появились на странице.',

    'tensor_site_succ':
    'Первая ссылка ведет на сайт Тензора.',
    'tensor_site_err':
    'Первая ссылка не ведет на сайт Тензора!',

    'first_test_finish':
    'Тест №1 успешно пройден!',

    'second_test_start':
    'Запуск теста №2 "test_switch_images".',

    'all_services_succ':
    'Раздел "Все сервисы" присутствует на странице.',

    'url_images_succ':
    'Перешли на URL-адрес https://yandex.ru/images/ "Яндекс Картинки".',
    'url_images_err':
    'Перешли на URL-адрес не соответствующий веб.странице "Яндекс Картинки"!',

    'name_category_succ':
    'Название категории картинок отображается в поле поиска.',
    'name_category_err':
    'Название категории картинок некорректно отображается в поле поиска!',

    'first_image_succ':
    'Первая картинка открылась.',

    'image_changed_succ':
    'При переходе к следующему изображению картинка сменилась.',
    'image_changed_err':
    'При переходе к следующему изображению картинка не сменилась!',

    'image_return_succ':
    'При переходе назад, картинка соответствует первому изображению.',
    'image_return_err':
    'При переходе назад, картинка не соответствует первому изображению!',

    'second_test_finish':
    'Тест №2 успешно пройден!'
}
